validation/rhoSnGrad/0.orig/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0];
internalField uniform (5 0 0);
boundaryField {
  inlet  { type fixedValue; value uniform (5 0 0); }
  outlet { type zeroGradient; }
  bottom { type noSlip; }
  slant  { type symmetryPlane; }
  frontBack { type empty; }
}
